Repository: zer0nomad/calkproject
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hy

source: Invalid input for A
hy: A-ի համար սխալ մուտք

source: Invalid input for B
hy: B-ի համար սխալ մուտք

source: Unknown operation
hy: Անհայտ գործողություն

source: Cannot divide by zero. Please check your values.
hy: Չի կարող բաժանվել զրոյի վրա: Խնդրում ենք ստուգել ձեր արժեքները:

source: Cannot take square root of a negative number.
hy: Չի կարող բացասական թվի քառակուսի արմատ վերցնել:

source: Logarithm is only defined for positive numbers.
hy: Լոգարիթմը սահմանվում է միայն դրական թվերի համար:

source: Factorial is only defined for non-negative integers.
hy: Ֆակտորիալը սահմանվում է միայն ոչ բացասական ամբողջ թվերի համար:

source: Factorial requires a whole number (integer).
hy: Ֆակտորիալը պահանջում է ամբողջ թիվ:

source: Invalid logarithm base. Must be positive and not equal to 1.
hy: Սխալ լոգարիթմի բազա: Դրական պետք է լինի և հավասար չլինել 1-ի:

source: Calculation error. Please check your input and try again.
hy: Հաշվարկման սխալ: Խնդրում ենք ստուգել ձեր մուտքը և կրկին փորձել:

source: Welcome to Calculator
hy: Բարի գալուստ հաշվիչ

source: Select a language in the top-right corner, enter two numbers, choose an operation, and click the button to calculate.
hy: Ընտրեք լեզու վերին աջ անկյունում, մուտքագրեք երկու թիվ, ընտրեք գործողություն և կրտնի հաշվարկի համար պահեք:

source: Close
hy: Փակել

source: Calculator
hy: Հաշվիչ

source: Scientific
hy: Գիտական

source: Basic
hy: Հիմնական

source: Engineering
hy: Ինժեներական

source: Basic mathematical operations
hy: Հիմնական մաթեմատիկական գործողություններ

source: Add
hy: Ավելացնել

source: Subtract
hy: Հանել

source: Multiply
hy: Բազմապատկել

source: Divide
hy: Բաժանել

source: Square A
hy: A-ի քառակուսի

source: Sqrt A
hy: A-ի քառակուսի արմատ

source: Reciprocal
hy: Փոխադարձ

source: Negate
hy: Հերքել

source: Scientific functions
hy: Գիտական ֆունկցիաներ

source: Sine
hy: Սինուս

source: Cosine
hy: Կոսինուս

source: Tangent
hy: Տանգեն

source: Natural Log
hy: Բնական լոգարիթմ

source: Exponential
hy: Էքսպոնենցիալ

source: Factorial
hy: Ֆակտորիալ

source: Percent
hy: Տոկոս

source: Power
hy: Ուժ

source: Pi
hy: Պի

source: Euler
hy: Էյլեր

source: Result
hy: Արդյունք
